<?php
/**
 *	+----------------------------------------------------------------------
 *	| $Desc: 数据库接口适配器
 *	+----------------------------------------------------------------------
 *	| $Author: 柴新鹏 <chaixinpeng@vip.qq.com>
 *	+----------------------------------------------------------------------
 *	| $Date: 
 *	+----------------------------------------------------------------------
 *
 */


namespace interf;

interface Db{


	public function connect($host,$user,$password,$dbname);

	public function query($sql);

	public function close();

}