<?php
/**
 *	+----------------------------------------------------------------------
 *	| $Desc: 观察者对象接口
 *	+----------------------------------------------------------------------
 *	| $Author: 柴新鹏 <chaixinpeng@vip.qq.com>
 *	+----------------------------------------------------------------------
 *	| $Date: 
 *	+----------------------------------------------------------------------
 *
 */

namespace interf;

interface ObServer{

	/**
	 * 观察者需要调用的方法
	 * @return [type] [description]
	 */
	public function trigger(\libs\ObException $oe);
}